Repository: AlexxNica/autovala
Catalog: autovala_gedit/po/*.po
Languages: es

source: Delete 'install' folder
es: Borrar el directorio 'folder'

source: All the content of the 'install' folder will be deleted. Continue?
es: Se borrará todo el contenido de la carpeta 'install'. ¿Continuar?

source: Open project file
es: Abrir fichero de proyecto

source: Opens the project file for the current source file
es: Abre el fichero de proyecto asociado al fichero fuente actual

source: Update project
es: Actualizar el proyecto

source: Updates the .avprj project file and CMakeLists files
es: Actualiza el fichero de proyecto .avprj y los ficheros CMakeLists

source: Run CMake
es: Ejecutar CMake

source: Runs CMake to create the Makefile
es: Ejecuta CMake para crear los ficheros Makefile

source: Build project
es: Construir proyecto

source: Builds the project running MAKE
es: Construye el fichero con MAKE

source: Cleans the project folder with 'make clean'
es: Limpia la carpeta del proyecto con 'make clean'

source: Full clean
es: Clean completo

source: Deletes the 'install' folder, to recreate the cmake system from scratch
es: Borra el directorio 'install', para recrear el sistema cmake desde cero

source: Full build
es: Construcción completa

source: Deletes the 'install' folder, updates the Autovala .avprj project file, runs cmake and launches make for a full build
es: Borra el directorio 'install', actualiza el fichero .avprj, ejecuta cmake y lanza make para una compilación completa

source: Launching '%s' at folder '%s'
es: Lanzando '%s' desde el directorio '%s'

source: Failed
es: Fallo

source: Done (return value %d)
es: Hecho (valor de retorno %d)

source: Updating project and cmake files
es: Actualizando ficheros de proyecto y de CMake

source: Aborting
es: Abortando

source: Updating CMake files
es: Actualizando los ficheros de CMake

source: Done
es: Hecho

source: Failed to get access to the project file
es: No se ha podido acceder al fichero de proyecto
